Тест_ЗУП_31_КОРП/src/InformationRegisters/УдалитьОбразованиеФизическихЛиц/УдалитьОбразованиеФизическихЛиц.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УдалитьОбразованиеФизическихЛиц</name>
  <resources>
    <name>ВидОбразования</name>
    <type>
      <types>CatalogRef.ВидыОбразованияФизическихЛиц</types>
    </type>
  </resources>
  <resources>
    <name>ВидПослевузовскогоОбразования</name>
    <type>
      <types>CatalogRef.ВидыОбразованияФизическихЛиц</types>
    </type>
  </resources>
  <resources>
    <name>УчебноеЗаведение</name>
    <type>
      <types>CatalogRef.УчебныеЗаведения</types>
    </type>
  </resources>
  <resources>
    <name>Специальность</name>
    <type>
      <types>CatalogRef.КлассификаторСпециальностейПоОбразованию</types>
    </type>
  </resources>
  <resources>
    <name>Диплом</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ГодОкончания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Квалификация</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерПоПорядку</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Тест_ЗУП_31_КОРП/src/InformationRegisters/УдалитьОбразованиеФизическихЛиц/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Функция ПредставлениеСведенийОбОбразованииФизическогоЛица(ФизическоеЛицоСсылка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ОбразованиеФЛ.ФизическоеЛицо,
		|	ОбразованиеФЛ.НомерПоПорядку,
		|	ОбразованиеФЛ.ВидОбразования,
		|	ОбразованиеФЛ.УчебноеЗаведение,
		|	ОбразованиеФЛ.Специальность,
		|	ОбразованиеФЛ.Диплом,
		|	ОбразованиеФЛ.ГодОкончания,
		|	ОбразованиеФЛ.Квалификация
		|ИЗ
		|	РегистрСведений.УдалитьОбразованиеФизическихЛиц КАК ОбразованиеФЛ
		|ГДЕ
		|	ОбразованиеФЛ.ФизическоеЛицо = &ФизическоеЛицоСсылка";
		
	Запрос.УстановитьПараметр("ФизическоеЛицоСсылка", ФизическоеЛицоСсылка);
	
	Возврат ПредставлениеСведенийОбОбразованииПоКоллекцииЗаписей(Запрос.Выполнить().Выгрузить());
	
КонецФункции

Функция ПредставлениеСведенийОбОбразованииПоКоллекцииЗаписей(НаборЗаписей) Экспорт
	
	ПредставлениеСведенийОбОбразовании = НСтр("ru='Нет сведений'");
	
	ПоследнеееПолученноеОбразование = Неопределено;
	Для Каждого СтрокаОбразование Из НаборЗаписей Цикл
		Если ПоследнеееПолученноеОбразование = Неопределено ИЛИ ПоследнеееПолученноеОбразование.ГодОкончания < СтрокаОбразование.ГодОкончания Тогда
			ПоследнеееПолученноеОбразование = СтрокаОбразование;
		КонецЕсли; 
	КонецЦикла;
	
	Если ПоследнеееПолученноеОбразование <> Неопределено Тогда
		ПредставлениеСведенийОбОбразовании = ?(ЗначениеЗаполнено(ПоследнеееПолученноеОбразование.ВидОбразования), Строка(ПоследнеееПолученноеОбразование.ВидОбразования), "")
									+ Символы.ПС
									+ ?(ЗначениеЗаполнено(ПоследнеееПолученноеОбразование.УчебноеЗаведение), Строка(ПоследнеееПолученноеОбразование.УчебноеЗаведение), "")
									+ ?(ЗначениеЗаполнено(ПоследнеееПолученноеОбразование.ГодОкончания), " (" + Формат(ПоследнеееПолученноеОбразование.ГодОкончания, "ЧГ=0") + ")", "") 
									+ Символы.ПС
									+ ?(ЗначениеЗаполнено(ПоследнеееПолученноеОбразование.Специальность), Строка(ПоследнеееПолученноеОбразование.Специальность), "")
									+ ?(ЗначениеЗаполнено(ПоследнеееПолученноеОбразование.Квалификация), ", " + Строка(ПоследнеееПолученноеОбразование.Квалификация), "");
	КонецЕсли; 
	
	Возврат ПредставлениеСведенийОбОбразовании;
	
КонецФункции

#КонецОбласти

#КонецЕсли
